9/data/attachments/14ad41c35328da1e.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_9f294a72-b022-490e-aa65-2f2eab2308cd</nif:username>
            <nif:friendToBeAdded>Brandon_entire_Friend_28166_3</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>